Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF82C010)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF82C014)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF82C018)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF82C01C)));
#define CM1MSKCON CM1MSKCON
extern volatile uint32_t   CM1MSKCON __attribute__((section("sfrs"), address(0xBF82C020)));
typedef struct {
  uint32_t AANEN:1;
  uint32_t AAEN:1;
  uint32_t ABNEN:1;
  uint32_t ABEN:1;
  uint32_t ACNEN:1;
  uint32_t ACEN:1;
  uint32_t PAGS:1;
  uint32_t NAGS:1;
  uint32_t OANEN:1;
  uint32_t OAEN:1;
  uint32_t OBNEN:1;
  uint32_t OBEN:1;
  uint32_t OCNEN:1;
  uint32_t OCEN:1;
  uint32_t :1;
  uint32_t HLMS:1;
  uint32_t SELSRCA:4;
  uint32_t SELSRCB:4;
  uint32_t SELSRCC:4;
} __CM1MSKCONbits_t;
extern volatile __CM1MSKCONbits_t CM1MSKCONbits __asm__ ("CM1MSKCON") __attribute__((section("sfrs"), address(0xBF82C020)));
extern volatile uint32_t        CM1MSKCONCLR __attribute__((section("sfrs"),address(0xBF82C024)));
extern volatile uint32_t        CM1MSKCONSET __attribute__((section("sfrs"),address(0xBF82C028)));
extern volatile uint32_t        CM1MSKCONINV __attribute__((section("sfrs"),address(0xBF82C02C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF82C030)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :2;
  uint32_t OPLPWR:1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :1;
  uint32_t HYSSEL:2;
  uint32_t :2;
  uint32_t HYSPOL:1;
  uint32_t :1;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF82C030)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF82C034)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF82C038)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF82C03C)));
#define CM2MSKCON CM2MSKCON
extern volatile uint32_t   CM2MSKCON __attribute__((section("sfrs"), address(0xBF82C040)));
typedef struct {
  uint32_t AANEN:1;
  uint32_t AAEN:1;
  uint32_t ABNEN:1;
  uint32_t ABEN:1;
  uint32_t ACNEN:1;
  uint32_t ACEN:1;
  uint32_t PAGS:1;
  uint32_t NAGS:1;
  uint32_t OANEN:1;
  uint32_t OAEN:1;
  uint32_t OBNEN:1;
  uint32_t OBEN:1;
  uint32_t OCNEN:1;
  uint32_t OCEN:1;
  uint32_t :1;
  uint32_t HLMS:1;
  uint32_t SELSRCA:4;
  uint32_t SELSRCB:4;
  uint32_t SELSRCC:4;
} __CM2MSKCONbits_t;
extern volatile __CM2MSKCONbits_t CM2MSKCONbits __asm__ ("CM2MSKCON") __attribute__((section("sfrs"), address(0xBF82C040)));
extern volatile uint32_t        CM2MSKCONCLR __attribute__((section("sfrs"),address(0xBF82C044)));
extern volatile uint32_t        CM2MSKCONSET __attribute__((section("sfrs"),address(0xBF82C048)));
extern volatile uint32_t        CM2MSKCONINV __attribute__((section("sfrs"),address(0xBF82C04C)));
#define CM3CON CM3CON
extern volatile uint32_t   CM3CON __attribute__((section("sfrs"), address(0xBF82C050)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :2;
  uint32_t OPLPWR:1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :1;
  uint32_t HYSSEL:2;
  uint32_t :2;
  uint32_t HYSPOL:1;
  uint32_t :1;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM3CONbits_t;
extern volatile __CM3CONbits_t CM3CONbits __asm__ ("CM3CON") __attribute__((section("sfrs"), address(0xBF82C050)));
extern volatile uint32_t        CM3CONCLR __attribute__((section("sfrs"),address(0xBF82C054)));
extern volatile uint32_t        CM3CONSET __attribute__((section("sfrs"),address(0xBF82C058)));
extern volatile uint32_t        CM3CONINV __attribute__((section("sfrs"),address(0xBF82C05C)));
#define CM3MSKCON CM3MSKCON
extern volatile uint32_t   CM3MSKCON __attribute__((section("sfrs"), address(0xBF82C060)));
typedef struct {
  uint32_t AANEN:1;
  uint32_t AAEN:1;
  uint32_t ABNEN:1;
  uint32_t ABEN:1;
  uint32_t ACNEN:1;
  uint32_t ACEN:1;
  uint32_t PAGS:1;
  uint32_t NAGS:1;
  uint32_t OANEN:1;
  uint32_t OAEN:1;
  uint32_t OBNEN:1;
  uint32_t OBEN:1;
  uint32_t OCNEN:1;
  uint32_t OCEN:1;
  uint32_t :1;
  uint32_t HLMS:1;
  uint32_t SELSRCA:4;
  uint32_t SELSRCB:4;
  uint32_t SELSRCC:4;
} __CM3MSKCONbits_t;
extern volatile __CM3MSKCONbits_t CM3MSKCONbits __asm__ ("CM3MSKCON") __attribute__((section("sfrs"), address(0xBF82C060)));
extern volatile uint32_t        CM3MSKCONCLR __attribute__((section("sfrs"),address(0xBF82C064)));
extern volatile uint32_t        CM3MSKCONSET __attribute__((section("sfrs"),address(0xBF82C068)));
extern volatile uint32_t        CM3MSKCONINV __attribute__((section("sfrs"),address(0xBF82C06C)));
#define CM4CON CM4CON
extern volatile uint32_t   CM4CON __attribute__((section("sfrs"), address(0xBF82C070)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :2;
  uint32_t OPLPWR:1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :1;
  uint32_t HYSSEL:2;
  uint32_t :2;
  uint32_t HYSPOL:1;
} __CM4CONbits_t;
extern volatile __CM4CONbits_t CM4CONbits __asm__ ("CM4CON") __attribute__((section("sfrs"), address(0xBF82C070)));
extern volatile uint32_t        CM4CONCLR __attribute__((section("sfrs"),address(0xBF82C074)));
extern volatile uint32_t        CM4CONSET __attribute__((section("sfrs"),address(0xBF82C078)));
extern volatile uint32_t        CM4CONINV __attribute__((section("sfrs"),address(0xBF82C07C)));
#define CM4MSKCON CM4MSKCON
extern volatile uint32_t   CM4MSKCON __attribute__((section("sfrs"), address(0xBF82C080)));
typedef struct {
  uint32_t AANEN:1;
  uint32_t AAEN:1;
  uint32_t ABNEN:1;
  uint32_t ABEN:1;
  uint32_t ACNEN:1;
  uint32_t ACEN:1;
  uint32_t PAGS:1;
  uint32_t NAGS:1;
  uint32_t OANEN:1;
  uint32_t OAEN:1;
  uint32_t OBNEN:1;
  uint32_t OBEN:1;
  uint32_t OCNEN:1;
  uint32_t OCEN:1;
  uint32_t :1;
  uint32_t HLMS:1;
  uint32_t SELSRCA:4;
  uint32_t SELSRCB:4;
  uint32_t SELSRCC:4;
} __CM4MSKCONbits_t;
extern volatile __CM4MSKCONbits_t CM4MSKCONbits __asm__ ("CM4MSKCON") __attribute__((section("sfrs"), address(0xBF82C080)));
extern volatile uint32_t        CM4MSKCONCLR __attribute__((section("sfrs"),address(0xBF82C084)));
extern volatile uint32_t        CM4MSKCONSET __attribute__((section("sfrs"),address(0xBF82C088)));
extern volatile uint32_t        CM4MSKCONINV __attribute__((section("sfrs"),address(0xBF82C08C)));
#define CM5CON CM5CON
extern volatile uint32_t   CM5CON __attribute__((section("sfrs"), address(0xBF82C090)));
typedef struct {
  uint32_t CCH:2;
  uint32_t :2;
  uint32_t CREF:1;
  uint32_t :1;
  uint32_t EVPOL:2;
  uint32_t COUT:1;
  uint32_t CEVT:1;
  uint32_t :2;
  uint32_t OPLPWR:1;
  uint32_t CPOL:1;
  uint32_t COE:1;
  uint32_t ON:1;
  uint32_t CFDIV:3;
  uint32_t CFLTREN:1;
  uint32_t CFSEL:3;
  uint32_t :1;
  uint32_t HYSSEL:2;
  uint32_t :2;
  uint32_t HYSPOL:1;
  uint32_t :1;
  uint32_t ENPGA:1;
  uint32_t OPAON:1;
} __CM5CONbits_t;
extern volatile __CM5CONbits_t CM5CONbits __asm__ ("CM5CON") __attribute__((section("sfrs"), address(0xBF82C090)));
extern volatile uint32_t        CM5CONCLR __attribute__((section("sfrs"),address(0xBF82C094)));
extern volatile uint32_t        CM5CONSET __attribute__((section("sfrs"),address(0xBF82C098)));
extern volatile uint32_t        CM5CONINV __attribute__((section("sfrs"),address(0xBF82C09C)));
#define CM5MSKCON CM5MSKCON
extern volatile uint32_t   CM5MSKCON __attribute__((section("sfrs"), address(0xBF82C0A0)));
typedef struct {
  uint32_t AANEN:1;
  uint32_t AAEN:1;
  uint32_t ABNEN:1;
  uint32_t ABEN:1;
  uint32_t ACNEN:1;
  uint32_t ACEN:1;
  uint32_t PAGS:1;
  uint32_t NAGS:1;
  uint32_t OANEN:1;
  uint32_t OAEN:1;
  uint32_t OBNEN:1;
  uint32_t OBEN:1;
  uint32_t OCNEN:1;
  uint32_t OCEN:1;
  uint32_t :1;
  uint32_t HLMS:1;
  uint32_t SELSRCA:4;
  uint32_t SELSRCB:4;
  uint32_t SELSRCC:4;
} __CM5MSKCONbits_t;
extern volatile __CM5MSKCONbits_t CM5MSKCONbits __asm__ ("CM5MSKCON") __attribute__((section("sfrs"), address(0xBF82C0A0)));
extern volatile uint32_t        CM5MSKCONCLR __attribute__((section("sfrs"),address(0xBF82C0A4)));
extern volatile uint32_t        CM5MSKCONSET __attribute__((section("sfrs"),address(0xBF82C0A8)));
extern volatile uint32_t        CM5MSKCONINV __attribute__((section("sfrs"),address(0xBF82C0AC)));
#define DAC1CON DAC1CON
extern volatile uint32_t   DAC1CON __attribute__((section("sfrs"), address(0xBF82C400)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC1CONbits_t;
extern volatile __DAC1CONbits_t DAC1CONbits __asm__ ("DAC1CON") __attribute__((section("sfrs"), address(0xBF82C400)));
extern volatile uint32_t        DAC1CONCLR __attribute__((section("sfrs"),address(0xBF82C404)));
extern volatile uint32_t        DAC1CONSET __attribute__((section("sfrs"),address(0xBF82C408)));
extern volatile uint32_t        DAC1CONINV __attribute__((section("sfrs"),address(0xBF82C40C)));
#define DAC2CON DAC2CON
extern volatile uint32_t   DAC2CON __attribute__((section("sfrs"), address(0xBF82C600)));
typedef struct {
  uint32_t REFSEL:2;
  uint32_t :6;
  uint32_t DACOE:1;
  uint32_t :6;
  uint32_t ON:1;
  uint32_t DACDAT:16;
} __DAC2CONbits_t;
