Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs"), address(0xBF860630)));
extern volatile uint32_t        LATGCLR __attribute__((section("sfrs"),address(0xBF860634)));
extern volatile uint32_t        LATGSET __attribute__((section("sfrs"),address(0xBF860638)));
extern volatile uint32_t        LATGINV __attribute__((section("sfrs"),address(0xBF86063C)));
#define ODCG ODCG
extern volatile uint32_t   ODCG __attribute__((section("sfrs"), address(0xBF860640)));
typedef union {
  struct {
    uint32_t ODCG0:1;
    uint32_t ODCG1:1;
    uint32_t :4;
    uint32_t ODCG6:1;
    uint32_t ODCG7:1;
    uint32_t ODCG8:1;
    uint32_t ODCG9:1;
    uint32_t ODCG10:1;
    uint32_t ODCG11:1;
    uint32_t ODCG12:1;
    uint32_t ODCG13:1;
    uint32_t ODCG14:1;
    uint32_t ODCG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCGbits_t;
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF860640)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF860644)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF860648)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF86064C)));
#define CNPUG CNPUG
extern volatile uint32_t   CNPUG __attribute__((section("sfrs"), address(0xBF860650)));
typedef union {
  struct {
    uint32_t CNPUG0:1;
    uint32_t CNPUG1:1;
    uint32_t :4;
    uint32_t CNPUG6:1;
    uint32_t CNPUG7:1;
    uint32_t CNPUG8:1;
    uint32_t CNPUG9:1;
    uint32_t CNPUG10:1;
    uint32_t CNPUG11:1;
    uint32_t CNPUG12:1;
    uint32_t CNPUG13:1;
    uint32_t CNPUG14:1;
    uint32_t CNPUG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs"), address(0xBF860650)));
extern volatile uint32_t        CNPUGCLR __attribute__((section("sfrs"),address(0xBF860654)));
extern volatile uint32_t        CNPUGSET __attribute__((section("sfrs"),address(0xBF860658)));
extern volatile uint32_t        CNPUGINV __attribute__((section("sfrs"),address(0xBF86065C)));
#define CNPDG CNPDG
extern volatile uint32_t   CNPDG __attribute__((section("sfrs"), address(0xBF860660)));
typedef union {
  struct {
    uint32_t CNPDG0:1;
    uint32_t CNPDG1:1;
    uint32_t :4;
    uint32_t CNPDG6:1;
    uint32_t CNPDG7:1;
    uint32_t CNPDG8:1;
    uint32_t CNPDG9:1;
    uint32_t CNPDG10:1;
    uint32_t CNPDG11:1;
    uint32_t CNPDG12:1;
    uint32_t CNPDG13:1;
    uint32_t CNPDG14:1;
    uint32_t CNPDG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs"), address(0xBF860660)));
extern volatile uint32_t        CNPDGCLR __attribute__((section("sfrs"),address(0xBF860664)));
extern volatile uint32_t        CNPDGSET __attribute__((section("sfrs"),address(0xBF860668)));
extern volatile uint32_t        CNPDGINV __attribute__((section("sfrs"),address(0xBF86066C)));
#define CNCONG CNCONG
extern volatile uint32_t   CNCONG __attribute__((section("sfrs"), address(0xBF860670)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs"), address(0xBF860670)));
extern volatile uint32_t        CNCONGCLR __attribute__((section("sfrs"),address(0xBF860674)));
extern volatile uint32_t        CNCONGSET __attribute__((section("sfrs"),address(0xBF860678)));
extern volatile uint32_t        CNCONGINV __attribute__((section("sfrs"),address(0xBF86067C)));
#define CNENG CNENG
extern volatile uint32_t   CNENG __attribute__((section("sfrs"), address(0xBF860680)));
typedef union {
  struct {
    uint32_t CNIEG0:1;
    uint32_t CNIEG1:1;
    uint32_t :4;
    uint32_t CNIEG6:1;
    uint32_t CNIEG7:1;
    uint32_t CNIEG8:1;
    uint32_t CNIEG9:1;
    uint32_t CNIEG10:1;
    uint32_t CNIEG11:1;
    uint32_t CNIEG12:1;
    uint32_t CNIEG13:1;
    uint32_t CNIEG14:1;
    uint32_t CNIEG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF860680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF860684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF860688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF86068C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF860690)));
typedef union {
  struct {
    uint32_t CNSTATG0:1;
    uint32_t CNSTATG1:1;
    uint32_t :4;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
    uint32_t CNSTATG10:1;
    uint32_t CNSTATG11:1;
    uint32_t CNSTATG12:1;
    uint32_t CNSTATG13:1;
    uint32_t CNSTATG14:1;
    uint32_t CNSTATG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF860690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF860694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF860698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF86069C)));
#define CNNEG CNNEG
extern volatile uint32_t   CNNEG __attribute__((section("sfrs"), address(0xBF8606A0)));
typedef struct {
  uint32_t CNNEG0:1;
  uint32_t CNNEG1:1;
  uint32_t :4;
  uint32_t CNNEG6:1;
  uint32_t CNNEG7:1;
  uint32_t CNNEG8:1;
  uint32_t CNNEG9:1;
  uint32_t CNNEG10:1;
  uint32_t CNNEG11:1;
  uint32_t CNNEG12:1;
  uint32_t CNNEG13:1;
  uint32_t CNNEG14:1;
  uint32_t CNNEG15:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits __asm__ ("CNNEG") __attribute__((section("sfrs"), address(0xBF8606A0)));
extern volatile uint32_t        CNNEGCLR __attribute__((section("sfrs"),address(0xBF8606A4)));
extern volatile uint32_t        CNNEGSET __attribute__((section("sfrs"),address(0xBF8606A8)));
extern volatile uint32_t        CNNEGINV __attribute__((section("sfrs"),address(0xBF8606AC)));
#define CNFG CNFG
extern volatile uint32_t   CNFG __attribute__((section("sfrs"), address(0xBF8606B0)));
typedef struct {
  uint32_t CNFG0:1;
  uint32_t CNFG1:1;
  uint32_t :4;
  uint32_t CNFG6:1;
  uint32_t CNFG7:1;
  uint32_t CNFG8:1;
  uint32_t CNFG9:1;
  uint32_t CNFG10:1;
  uint32_t CNFG11:1;
  uint32_t CNFG12:1;
  uint32_t CNFG13:1;
  uint32_t CNFG14:1;
  uint32_t CNFG15:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits __asm__ ("CNFG") __attribute__((section("sfrs"), address(0xBF8606B0)));
extern volatile uint32_t        CNFGCLR __attribute__((section("sfrs"),address(0xBF8606B4)));
extern volatile uint32_t        CNFGSET __attribute__((section("sfrs"),address(0xBF8606B8)));
extern volatile uint32_t        CNFGINV __attribute__((section("sfrs"),address(0xBF8606BC)));
#define CFD1CON CFD1CON
extern volatile uint32_t   CFD1CON __attribute__((section("sfrs"), address(0xBF880000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t ISOCRCEN:1;
    uint32_t PXEDIS:1;
    uint32_t CLKSEL0:1;
    uint32_t WAKFIL:1;
    uint32_t WFT:2;
    uint32_t BUSY:1;
    uint32_t BRSDIS:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t RTXAT:1;
    uint32_t ESIGM:1;
    uint32_t SERR2LOM:1;
    uint32_t STEF:1;
    uint32_t TXQEN:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
    uint32_t TXBWS:4;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1CONbits_t;
extern volatile __CFD1CONbits_t CFD1CONbits __asm__ ("CFD1CON") __attribute__((section("sfrs"), address(0xBF880000)));
extern volatile uint32_t        CFD1CONCLR __attribute__((section("sfrs"),address(0xBF880004)));
extern volatile uint32_t        CFD1CONSET __attribute__((section("sfrs"),address(0xBF880008)));
extern volatile uint32_t        CFD1CONINV __attribute__((section("sfrs"),address(0xBF88000C)));
#define CFD1NBTCFG CFD1NBTCFG
extern volatile uint32_t   CFD1NBTCFG __attribute__((section("sfrs"), address(0xBF880010)));
typedef struct {
  uint32_t SJW:7;
  uint32_t :1;
  uint32_t TSEG2:7;
  uint32_t :1;
  uint32_t TSEG1:8;
  uint32_t BRP:8;
} __CFD1NBTCFGbits_t;
extern volatile __CFD1NBTCFGbits_t CFD1NBTCFGbits __asm__ ("CFD1NBTCFG") __attribute__((section("sfrs"), address(0xBF880010)));
extern volatile uint32_t        CFD1NBTCFGCLR __attribute__((section("sfrs"),address(0xBF880014)));
extern volatile uint32_t        CFD1NBTCFGSET __attribute__((section("sfrs"),address(0xBF880018)));
extern volatile uint32_t        CFD1NBTCFGINV __attribute__((section("sfrs"),address(0xBF88001C)));
#define CFD1DBTCFG CFD1DBTCFG
extern volatile uint32_t   CFD1DBTCFG __attribute__((section("sfrs"), address(0xBF880020)));
typedef struct {
  uint32_t SJW:4;
  uint32_t :4;
  uint32_t TSEG2:4;
  uint32_t :4;
  uint32_t TSEG1:5;
  uint32_t :3;
  uint32_t BRP:8;
} __CFD1DBTCFGbits_t;
extern volatile __CFD1DBTCFGbits_t CFD1DBTCFGbits __asm__ ("CFD1DBTCFG") __attribute__((section("sfrs"), address(0xBF880020)));
extern volatile uint32_t        CFD1DBTCFGCLR __attribute__((section("sfrs"),address(0xBF880024)));
extern volatile uint32_t        CFD1DBTCFGSET __attribute__((section("sfrs"),address(0xBF880028)));
extern volatile uint32_t        CFD1DBTCFGINV __attribute__((section("sfrs"),address(0xBF88002C)));
#define CFD1TDC CFD1TDC
extern volatile uint32_t   CFD1TDC __attribute__((section("sfrs"), address(0xBF880030)));
typedef struct {
  uint32_t TDCV:6;
  uint32_t :2;
  uint32_t TDCO:7;
  uint32_t :1;
  uint32_t TDCMOD:2;
  uint32_t :6;
  uint32_t SID11EN:1;
  uint32_t EDGFLTEN:1;
} __CFD1TDCbits_t;
extern volatile __CFD1TDCbits_t CFD1TDCbits __asm__ ("CFD1TDC") __attribute__((section("sfrs"), address(0xBF880030)));
extern volatile uint32_t        CFD1TDCCLR __attribute__((section("sfrs"),address(0xBF880034)));
extern volatile uint32_t        CFD1TDCSET __attribute__((section("sfrs"),address(0xBF880038)));
extern volatile uint32_t        CFD1TDCINV __attribute__((section("sfrs"),address(0xBF88003C)));
#define CFD1TBC CFD1TBC
extern volatile uint32_t   CFD1TBC __attribute__((section("sfrs"), address(0xBF880040)));
typedef struct {
  uint32_t TBC:32;
} __CFD1TBCbits_t;
extern volatile __CFD1TBCbits_t CFD1TBCbits __asm__ ("CFD1TBC") __attribute__((section("sfrs"), address(0xBF880040)));
extern volatile uint32_t        CFD1TBCCLR __attribute__((section("sfrs"),address(0xBF880044)));
extern volatile uint32_t        CFD1TBCSET __attribute__((section("sfrs"),address(0xBF880048)));
extern volatile uint32_t        CFD1TBCINV __attribute__((section("sfrs"),address(0xBF88004C)));
#define CFD1TSCON CFD1TSCON
extern volatile uint32_t   CFD1TSCON __attribute__((section("sfrs"), address(0xBF880050)));
typedef struct {
  uint32_t TBCPRE:10;
  uint32_t :6;
  uint32_t TBCEN:1;
  uint32_t TSEOF:1;
  uint32_t TSRES:1;
} __CFD1TSCONbits_t;
extern volatile __CFD1TSCONbits_t CFD1TSCONbits __asm__ ("CFD1TSCON") __attribute__((section("sfrs"), address(0xBF880050)));
extern volatile uint32_t        CFD1TSCONCLR __attribute__((section("sfrs"),address(0xBF880054)));
extern volatile uint32_t        CFD1TSCONSET __attribute__((section("sfrs"),address(0xBF880058)));
extern volatile uint32_t        CFD1TSCONINV __attribute__((section("sfrs"),address(0xBF88005C)));
#define CFD1VEC CFD1VEC
extern volatile uint32_t   CFD1VEC __attribute__((section("sfrs"), address(0xBF880060)));
typedef union {
  struct {
    uint32_t ICODE:7;
    uint32_t :1;
    uint32_t FILHIT:5;
    uint32_t :3;
    uint32_t TXCODE:7;
    uint32_t :1;
    uint32_t RXCODE:7;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1VECbits_t;
extern volatile __CFD1VECbits_t CFD1VECbits __asm__ ("CFD1VEC") __attribute__((section("sfrs"), address(0xBF880060)));
extern volatile uint32_t        CFD1VECCLR __attribute__((section("sfrs"),address(0xBF880064)));
extern volatile uint32_t        CFD1VECSET __attribute__((section("sfrs"),address(0xBF880068)));
extern volatile uint32_t        CFD1VECINV __attribute__((section("sfrs"),address(0xBF88006C)));
#define CFD1INT CFD1INT
extern volatile uint32_t   CFD1INT __attribute__((section("sfrs"), address(0xBF880070)));
typedef union {
  struct {
    uint32_t TXIF:1;
    uint32_t RXIF:1;
    uint32_t TBCIF:1;
    uint32_t MODIF:1;
    uint32_t TEFIF:1;
    uint32_t :5;
    uint32_t TXATIF:1;
    uint32_t RXOVIF:1;
    uint32_t SERRIF:1;
    uint32_t CERRIF:1;
    uint32_t WAKIF:1;
    uint32_t IVMIF:1;
    uint32_t TXIE:1;
    uint32_t RXIE:1;
    uint32_t TBCIE:1;
    uint32_t MODIE:1;
    uint32_t TEFIE:1;
    uint32_t :5;
    uint32_t TXATIE:1;
    uint32_t RXOVIE:1;
    uint32_t SERRIE:1;
    uint32_t CERRIE:1;
    uint32_t WAKIE:1;
    uint32_t IVMIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD1INTbits_t;
