Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
extern volatile __CFD1FIFOUA14bits_t CFD1FIFOUA14bits __asm__ ("CFD1FIFOUA14") __attribute__((section("sfrs"), address(0xBF880400)));
extern volatile uint32_t        CFD1FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF880404)));
extern volatile uint32_t        CFD1FIFOUA14SET __attribute__((section("sfrs"),address(0xBF880408)));
extern volatile uint32_t        CFD1FIFOUA14INV __attribute__((section("sfrs"),address(0xBF88040C)));
#define CFD1FIFOCON15 CFD1FIFOCON15
extern volatile uint32_t   CFD1FIFOCON15 __attribute__((section("sfrs"), address(0xBF880410)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON15bits_t;
extern volatile __CFD1FIFOCON15bits_t CFD1FIFOCON15bits __asm__ ("CFD1FIFOCON15") __attribute__((section("sfrs"), address(0xBF880410)));
extern volatile uint32_t        CFD1FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF880414)));
extern volatile uint32_t        CFD1FIFOCON15SET __attribute__((section("sfrs"),address(0xBF880418)));
extern volatile uint32_t        CFD1FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88041C)));
#define CFD1FIFOSTA15 CFD1FIFOSTA15
extern volatile uint32_t   CFD1FIFOSTA15 __attribute__((section("sfrs"), address(0xBF880420)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA15bits_t;
extern volatile __CFD1FIFOSTA15bits_t CFD1FIFOSTA15bits __asm__ ("CFD1FIFOSTA15") __attribute__((section("sfrs"), address(0xBF880420)));
extern volatile uint32_t        CFD1FIFOSTA15CLR __attribute__((section("sfrs"),address(0xBF880424)));
extern volatile uint32_t        CFD1FIFOSTA15SET __attribute__((section("sfrs"),address(0xBF880428)));
extern volatile uint32_t        CFD1FIFOSTA15INV __attribute__((section("sfrs"),address(0xBF88042C)));
#define CFD1FIFOUA15 CFD1FIFOUA15
extern volatile uint32_t   CFD1FIFOUA15 __attribute__((section("sfrs"), address(0xBF880430)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA15bits_t;
extern volatile __CFD1FIFOUA15bits_t CFD1FIFOUA15bits __asm__ ("CFD1FIFOUA15") __attribute__((section("sfrs"), address(0xBF880430)));
extern volatile uint32_t        CFD1FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF880434)));
extern volatile uint32_t        CFD1FIFOUA15SET __attribute__((section("sfrs"),address(0xBF880438)));
extern volatile uint32_t        CFD1FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88043C)));
#define CFD1FIFOCON16 CFD1FIFOCON16
extern volatile uint32_t   CFD1FIFOCON16 __attribute__((section("sfrs"), address(0xBF880440)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON16bits_t;
extern volatile __CFD1FIFOCON16bits_t CFD1FIFOCON16bits __asm__ ("CFD1FIFOCON16") __attribute__((section("sfrs"), address(0xBF880440)));
extern volatile uint32_t        CFD1FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF880444)));
extern volatile uint32_t        CFD1FIFOCON16SET __attribute__((section("sfrs"),address(0xBF880448)));
extern volatile uint32_t        CFD1FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88044C)));
#define CFD1FIFOSTA16 CFD1FIFOSTA16
extern volatile uint32_t   CFD1FIFOSTA16 __attribute__((section("sfrs"), address(0xBF880450)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA16bits_t;
extern volatile __CFD1FIFOSTA16bits_t CFD1FIFOSTA16bits __asm__ ("CFD1FIFOSTA16") __attribute__((section("sfrs"), address(0xBF880450)));
extern volatile uint32_t        CFD1FIFOSTA16CLR __attribute__((section("sfrs"),address(0xBF880454)));
extern volatile uint32_t        CFD1FIFOSTA16SET __attribute__((section("sfrs"),address(0xBF880458)));
extern volatile uint32_t        CFD1FIFOSTA16INV __attribute__((section("sfrs"),address(0xBF88045C)));
#define CFD1FIFOUA16 CFD1FIFOUA16
extern volatile uint32_t   CFD1FIFOUA16 __attribute__((section("sfrs"), address(0xBF880460)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA16bits_t;
extern volatile __CFD1FIFOUA16bits_t CFD1FIFOUA16bits __asm__ ("CFD1FIFOUA16") __attribute__((section("sfrs"), address(0xBF880460)));
extern volatile uint32_t        CFD1FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF880464)));
extern volatile uint32_t        CFD1FIFOUA16SET __attribute__((section("sfrs"),address(0xBF880468)));
extern volatile uint32_t        CFD1FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88046C)));
#define CFD1FIFOCON17 CFD1FIFOCON17
extern volatile uint32_t   CFD1FIFOCON17 __attribute__((section("sfrs"), address(0xBF880470)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON17bits_t;
extern volatile __CFD1FIFOCON17bits_t CFD1FIFOCON17bits __asm__ ("CFD1FIFOCON17") __attribute__((section("sfrs"), address(0xBF880470)));
extern volatile uint32_t        CFD1FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF880474)));
extern volatile uint32_t        CFD1FIFOCON17SET __attribute__((section("sfrs"),address(0xBF880478)));
extern volatile uint32_t        CFD1FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88047C)));
#define CFD1FIFOSTA17 CFD1FIFOSTA17
extern volatile uint32_t   CFD1FIFOSTA17 __attribute__((section("sfrs"), address(0xBF880480)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA17bits_t;
extern volatile __CFD1FIFOSTA17bits_t CFD1FIFOSTA17bits __asm__ ("CFD1FIFOSTA17") __attribute__((section("sfrs"), address(0xBF880480)));
extern volatile uint32_t        CFD1FIFOSTA17CLR __attribute__((section("sfrs"),address(0xBF880484)));
extern volatile uint32_t        CFD1FIFOSTA17SET __attribute__((section("sfrs"),address(0xBF880488)));
extern volatile uint32_t        CFD1FIFOSTA17INV __attribute__((section("sfrs"),address(0xBF88048C)));
#define CFD1FIFOUA17 CFD1FIFOUA17
extern volatile uint32_t   CFD1FIFOUA17 __attribute__((section("sfrs"), address(0xBF880490)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA17bits_t;
extern volatile __CFD1FIFOUA17bits_t CFD1FIFOUA17bits __asm__ ("CFD1FIFOUA17") __attribute__((section("sfrs"), address(0xBF880490)));
extern volatile uint32_t        CFD1FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF880494)));
extern volatile uint32_t        CFD1FIFOUA17SET __attribute__((section("sfrs"),address(0xBF880498)));
extern volatile uint32_t        CFD1FIFOUA17INV __attribute__((section("sfrs"),address(0xBF88049C)));
#define CFD1FIFOCON18 CFD1FIFOCON18
extern volatile uint32_t   CFD1FIFOCON18 __attribute__((section("sfrs"), address(0xBF8804A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON18bits_t;
extern volatile __CFD1FIFOCON18bits_t CFD1FIFOCON18bits __asm__ ("CFD1FIFOCON18") __attribute__((section("sfrs"), address(0xBF8804A0)));
extern volatile uint32_t        CFD1FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF8804A4)));
extern volatile uint32_t        CFD1FIFOCON18SET __attribute__((section("sfrs"),address(0xBF8804A8)));
extern volatile uint32_t        CFD1FIFOCON18INV __attribute__((section("sfrs"),address(0xBF8804AC)));
#define CFD1FIFOSTA18 CFD1FIFOSTA18
extern volatile uint32_t   CFD1FIFOSTA18 __attribute__((section("sfrs"), address(0xBF8804B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA18bits_t;
extern volatile __CFD1FIFOSTA18bits_t CFD1FIFOSTA18bits __asm__ ("CFD1FIFOSTA18") __attribute__((section("sfrs"), address(0xBF8804B0)));
extern volatile uint32_t        CFD1FIFOSTA18CLR __attribute__((section("sfrs"),address(0xBF8804B4)));
extern volatile uint32_t        CFD1FIFOSTA18SET __attribute__((section("sfrs"),address(0xBF8804B8)));
extern volatile uint32_t        CFD1FIFOSTA18INV __attribute__((section("sfrs"),address(0xBF8804BC)));
#define CFD1FIFOUA18 CFD1FIFOUA18
extern volatile uint32_t   CFD1FIFOUA18 __attribute__((section("sfrs"), address(0xBF8804C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA18bits_t;
extern volatile __CFD1FIFOUA18bits_t CFD1FIFOUA18bits __asm__ ("CFD1FIFOUA18") __attribute__((section("sfrs"), address(0xBF8804C0)));
extern volatile uint32_t        CFD1FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF8804C4)));
extern volatile uint32_t        CFD1FIFOUA18SET __attribute__((section("sfrs"),address(0xBF8804C8)));
extern volatile uint32_t        CFD1FIFOUA18INV __attribute__((section("sfrs"),address(0xBF8804CC)));
#define CFD1FIFOCON19 CFD1FIFOCON19
extern volatile uint32_t   CFD1FIFOCON19 __attribute__((section("sfrs"), address(0xBF8804D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON19bits_t;
