Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
extern volatile __CFD1FIFOUA22bits_t CFD1FIFOUA22bits __asm__ ("CFD1FIFOUA22") __attribute__((section("sfrs"), address(0xBF880580)));
extern volatile uint32_t        CFD1FIFOUA22CLR __attribute__((section("sfrs"),address(0xBF880584)));
extern volatile uint32_t        CFD1FIFOUA22SET __attribute__((section("sfrs"),address(0xBF880588)));
extern volatile uint32_t        CFD1FIFOUA22INV __attribute__((section("sfrs"),address(0xBF88058C)));
#define CFD1FIFOCON23 CFD1FIFOCON23
extern volatile uint32_t   CFD1FIFOCON23 __attribute__((section("sfrs"), address(0xBF880590)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON23bits_t;
extern volatile __CFD1FIFOCON23bits_t CFD1FIFOCON23bits __asm__ ("CFD1FIFOCON23") __attribute__((section("sfrs"), address(0xBF880590)));
extern volatile uint32_t        CFD1FIFOCON23CLR __attribute__((section("sfrs"),address(0xBF880594)));
extern volatile uint32_t        CFD1FIFOCON23SET __attribute__((section("sfrs"),address(0xBF880598)));
extern volatile uint32_t        CFD1FIFOCON23INV __attribute__((section("sfrs"),address(0xBF88059C)));
#define CFD1FIFOSTA23 CFD1FIFOSTA23
extern volatile uint32_t   CFD1FIFOSTA23 __attribute__((section("sfrs"), address(0xBF8805A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA23bits_t;
extern volatile __CFD1FIFOSTA23bits_t CFD1FIFOSTA23bits __asm__ ("CFD1FIFOSTA23") __attribute__((section("sfrs"), address(0xBF8805A0)));
extern volatile uint32_t        CFD1FIFOSTA23CLR __attribute__((section("sfrs"),address(0xBF8805A4)));
extern volatile uint32_t        CFD1FIFOSTA23SET __attribute__((section("sfrs"),address(0xBF8805A8)));
extern volatile uint32_t        CFD1FIFOSTA23INV __attribute__((section("sfrs"),address(0xBF8805AC)));
#define CFD1FIFOUA23 CFD1FIFOUA23
extern volatile uint32_t   CFD1FIFOUA23 __attribute__((section("sfrs"), address(0xBF8805B0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA23bits_t;
extern volatile __CFD1FIFOUA23bits_t CFD1FIFOUA23bits __asm__ ("CFD1FIFOUA23") __attribute__((section("sfrs"), address(0xBF8805B0)));
extern volatile uint32_t        CFD1FIFOUA23CLR __attribute__((section("sfrs"),address(0xBF8805B4)));
extern volatile uint32_t        CFD1FIFOUA23SET __attribute__((section("sfrs"),address(0xBF8805B8)));
extern volatile uint32_t        CFD1FIFOUA23INV __attribute__((section("sfrs"),address(0xBF8805BC)));
#define CFD1FIFOCON24 CFD1FIFOCON24
extern volatile uint32_t   CFD1FIFOCON24 __attribute__((section("sfrs"), address(0xBF8805C0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON24bits_t;
extern volatile __CFD1FIFOCON24bits_t CFD1FIFOCON24bits __asm__ ("CFD1FIFOCON24") __attribute__((section("sfrs"), address(0xBF8805C0)));
extern volatile uint32_t        CFD1FIFOCON24CLR __attribute__((section("sfrs"),address(0xBF8805C4)));
extern volatile uint32_t        CFD1FIFOCON24SET __attribute__((section("sfrs"),address(0xBF8805C8)));
extern volatile uint32_t        CFD1FIFOCON24INV __attribute__((section("sfrs"),address(0xBF8805CC)));
#define CFD1FIFOSTA24 CFD1FIFOSTA24
extern volatile uint32_t   CFD1FIFOSTA24 __attribute__((section("sfrs"), address(0xBF8805D0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA24bits_t;
extern volatile __CFD1FIFOSTA24bits_t CFD1FIFOSTA24bits __asm__ ("CFD1FIFOSTA24") __attribute__((section("sfrs"), address(0xBF8805D0)));
extern volatile uint32_t        CFD1FIFOSTA24CLR __attribute__((section("sfrs"),address(0xBF8805D4)));
extern volatile uint32_t        CFD1FIFOSTA24SET __attribute__((section("sfrs"),address(0xBF8805D8)));
extern volatile uint32_t        CFD1FIFOSTA24INV __attribute__((section("sfrs"),address(0xBF8805DC)));
#define CFD1FIFOUA24 CFD1FIFOUA24
extern volatile uint32_t   CFD1FIFOUA24 __attribute__((section("sfrs"), address(0xBF8805E0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA24bits_t;
extern volatile __CFD1FIFOUA24bits_t CFD1FIFOUA24bits __asm__ ("CFD1FIFOUA24") __attribute__((section("sfrs"), address(0xBF8805E0)));
extern volatile uint32_t        CFD1FIFOUA24CLR __attribute__((section("sfrs"),address(0xBF8805E4)));
extern volatile uint32_t        CFD1FIFOUA24SET __attribute__((section("sfrs"),address(0xBF8805E8)));
extern volatile uint32_t        CFD1FIFOUA24INV __attribute__((section("sfrs"),address(0xBF8805EC)));
#define CFD1FIFOCON25 CFD1FIFOCON25
extern volatile uint32_t   CFD1FIFOCON25 __attribute__((section("sfrs"), address(0xBF8805F0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON25bits_t;
extern volatile __CFD1FIFOCON25bits_t CFD1FIFOCON25bits __asm__ ("CFD1FIFOCON25") __attribute__((section("sfrs"), address(0xBF8805F0)));
extern volatile uint32_t        CFD1FIFOCON25CLR __attribute__((section("sfrs"),address(0xBF8805F4)));
extern volatile uint32_t        CFD1FIFOCON25SET __attribute__((section("sfrs"),address(0xBF8805F8)));
extern volatile uint32_t        CFD1FIFOCON25INV __attribute__((section("sfrs"),address(0xBF8805FC)));
#define CFD1FIFOSTA25 CFD1FIFOSTA25
extern volatile uint32_t   CFD1FIFOSTA25 __attribute__((section("sfrs"), address(0xBF880600)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA25bits_t;
extern volatile __CFD1FIFOSTA25bits_t CFD1FIFOSTA25bits __asm__ ("CFD1FIFOSTA25") __attribute__((section("sfrs"), address(0xBF880600)));
extern volatile uint32_t        CFD1FIFOSTA25CLR __attribute__((section("sfrs"),address(0xBF880604)));
extern volatile uint32_t        CFD1FIFOSTA25SET __attribute__((section("sfrs"),address(0xBF880608)));
extern volatile uint32_t        CFD1FIFOSTA25INV __attribute__((section("sfrs"),address(0xBF88060C)));
#define CFD1FIFOUA25 CFD1FIFOUA25
extern volatile uint32_t   CFD1FIFOUA25 __attribute__((section("sfrs"), address(0xBF880610)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA25bits_t;
extern volatile __CFD1FIFOUA25bits_t CFD1FIFOUA25bits __asm__ ("CFD1FIFOUA25") __attribute__((section("sfrs"), address(0xBF880610)));
extern volatile uint32_t        CFD1FIFOUA25CLR __attribute__((section("sfrs"),address(0xBF880614)));
extern volatile uint32_t        CFD1FIFOUA25SET __attribute__((section("sfrs"),address(0xBF880618)));
extern volatile uint32_t        CFD1FIFOUA25INV __attribute__((section("sfrs"),address(0xBF88061C)));
#define CFD1FIFOCON26 CFD1FIFOCON26
extern volatile uint32_t   CFD1FIFOCON26 __attribute__((section("sfrs"), address(0xBF880620)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON26bits_t;
extern volatile __CFD1FIFOCON26bits_t CFD1FIFOCON26bits __asm__ ("CFD1FIFOCON26") __attribute__((section("sfrs"), address(0xBF880620)));
extern volatile uint32_t        CFD1FIFOCON26CLR __attribute__((section("sfrs"),address(0xBF880624)));
extern volatile uint32_t        CFD1FIFOCON26SET __attribute__((section("sfrs"),address(0xBF880628)));
extern volatile uint32_t        CFD1FIFOCON26INV __attribute__((section("sfrs"),address(0xBF88062C)));
#define CFD1FIFOSTA26 CFD1FIFOSTA26
extern volatile uint32_t   CFD1FIFOSTA26 __attribute__((section("sfrs"), address(0xBF880630)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA26bits_t;
extern volatile __CFD1FIFOSTA26bits_t CFD1FIFOSTA26bits __asm__ ("CFD1FIFOSTA26") __attribute__((section("sfrs"), address(0xBF880630)));
extern volatile uint32_t        CFD1FIFOSTA26CLR __attribute__((section("sfrs"),address(0xBF880634)));
extern volatile uint32_t        CFD1FIFOSTA26SET __attribute__((section("sfrs"),address(0xBF880638)));
extern volatile uint32_t        CFD1FIFOSTA26INV __attribute__((section("sfrs"),address(0xBF88063C)));
#define CFD1FIFOUA26 CFD1FIFOUA26
extern volatile uint32_t   CFD1FIFOUA26 __attribute__((section("sfrs"), address(0xBF880640)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA26bits_t;
extern volatile __CFD1FIFOUA26bits_t CFD1FIFOUA26bits __asm__ ("CFD1FIFOUA26") __attribute__((section("sfrs"), address(0xBF880640)));
extern volatile uint32_t        CFD1FIFOUA26CLR __attribute__((section("sfrs"),address(0xBF880644)));
extern volatile uint32_t        CFD1FIFOUA26SET __attribute__((section("sfrs"),address(0xBF880648)));
extern volatile uint32_t        CFD1FIFOUA26INV __attribute__((section("sfrs"),address(0xBF88064C)));
#define CFD1FIFOCON27 CFD1FIFOCON27
extern volatile uint32_t   CFD1FIFOCON27 __attribute__((section("sfrs"), address(0xBF880650)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON27bits_t;
