Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
#define _IEC7_SBIE_POSITION                      0x00000006
#define _IEC7_SBIE_MASK                          0x00000040
#define _IEC7_SBIE_LENGTH                        0x00000001

#define _IEC7_PWM7IE_POSITION                    0x0000000E
#define _IEC7_PWM7IE_MASK                        0x00004000
#define _IEC7_PWM7IE_LENGTH                      0x00000001

#define _IEC7_PWM8IE_POSITION                    0x0000000F
#define _IEC7_PWM8IE_MASK                        0x00008000
#define _IEC7_PWM8IE_LENGTH                      0x00000001

#define _IEC7_PWM9IE_POSITION                    0x00000010
#define _IEC7_PWM9IE_MASK                        0x00010000
#define _IEC7_PWM9IE_LENGTH                      0x00000001

#define _IEC7_AD1DC3IE_POSITION                  0x00000015
#define _IEC7_AD1DC3IE_MASK                      0x00200000
#define _IEC7_AD1DC3IE_LENGTH                    0x00000001

#define _IEC7_AD1DC4IE_POSITION                  0x00000016
#define _IEC7_AD1DC4IE_MASK                      0x00400000
#define _IEC7_AD1DC4IE_LENGTH                    0x00000001

#define _IEC7_PCACHEIE_POSITION                  0x00000017
#define _IEC7_PCACHEIE_MASK                      0x00800000
#define _IEC7_PCACHEIE_LENGTH                    0x00000001

#define _IEC7_CLC1IE_POSITION                    0x00000019
#define _IEC7_CLC1IE_MASK                        0x02000000
#define _IEC7_CLC1IE_LENGTH                      0x00000001

#define _IEC7_CLC2IE_POSITION                    0x0000001A
#define _IEC7_CLC2IE_MASK                        0x04000000
#define _IEC7_CLC2IE_LENGTH                      0x00000001

#define _IEC7_CLC3IE_POSITION                    0x0000001B
#define _IEC7_CLC3IE_MASK                        0x08000000
#define _IEC7_CLC3IE_LENGTH                      0x00000001

#define _IEC7_CLC4IE_POSITION                    0x0000001C
#define _IEC7_CLC4IE_MASK                        0x10000000
#define _IEC7_CLC4IE_LENGTH                      0x00000001

#define _IEC7_CPCIE_POSITION                     0x0000001E
#define _IEC7_CPCIE_MASK                         0x40000000
#define _IEC7_CPCIE_LENGTH                       0x00000001

#define _IEC7_CFDCIE_POSITION                    0x0000001F
#define _IEC7_CFDCIE_MASK                        0x80000000
#define _IEC7_CFDCIE_LENGTH                      0x00000001

#define _IEC7_w_POSITION                         0x00000000
#define _IEC7_w_MASK                             0xFFFFFFFF
#define _IEC7_w_LENGTH                           0x00000020

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

#define _IPC0_CS1IS_POSITION                     0x00000010
#define _IPC0_CS1IS_MASK                         0x00030000
#define _IPC0_CS1IS_LENGTH                       0x00000002

#define _IPC0_CS1IP_POSITION                     0x00000012
#define _IPC0_CS1IP_MASK                         0x001C0000
#define _IPC0_CS1IP_LENGTH                       0x00000003

#define _IPC0_INT0IS_POSITION                    0x00000018
#define _IPC0_INT0IS_MASK                        0x03000000
#define _IPC0_INT0IS_LENGTH                      0x00000002

#define _IPC0_INT0IP_POSITION                    0x0000001A
#define _IPC0_INT0IP_MASK                        0x1C000000
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_w_POSITION                         0x00000000
#define _IPC0_w_MASK                             0xFFFFFFFF
#define _IPC0_w_LENGTH                           0x00000020

#define _IPC1_T1IS_POSITION                      0x00000000
#define _IPC1_T1IS_MASK                          0x00000003
#define _IPC1_T1IS_LENGTH                        0x00000002

#define _IPC1_T1IP_POSITION                      0x00000002
#define _IPC1_T1IP_MASK                          0x0000001C
#define _IPC1_T1IP_LENGTH                        0x00000003

#define _IPC1_IC1EIS_POSITION                    0x00000008
#define _IPC1_IC1EIS_MASK                        0x00000300
#define _IPC1_IC1EIS_LENGTH                      0x00000002

#define _IPC1_IC1EIP_POSITION                    0x0000000A
#define _IPC1_IC1EIP_MASK                        0x00001C00
#define _IPC1_IC1EIP_LENGTH                      0x00000003

#define _IPC1_IC1IS_POSITION                     0x00000010
#define _IPC1_IC1IS_MASK                         0x00030000
#define _IPC1_IC1IS_LENGTH                       0x00000002

#define _IPC1_IC1IP_POSITION                     0x00000012
#define _IPC1_IC1IP_MASK                         0x001C0000
#define _IPC1_IC1IP_LENGTH                       0x00000003

#define _IPC1_OC1IS_POSITION                     0x00000018
#define _IPC1_OC1IS_MASK                         0x03000000
#define _IPC1_OC1IS_LENGTH                       0x00000002

#define _IPC1_OC1IP_POSITION                     0x0000001A
#define _IPC1_OC1IP_MASK                         0x1C000000
#define _IPC1_OC1IP_LENGTH                       0x00000003

#define _IPC1_w_POSITION                         0x00000000
#define _IPC1_w_MASK                             0xFFFFFFFF
#define _IPC1_w_LENGTH                           0x00000020

#define _IPC2_INT1IS_POSITION                    0x00000000
#define _IPC2_INT1IS_MASK                        0x00000003
#define _IPC2_INT1IS_LENGTH                      0x00000002

#define _IPC2_INT1IP_POSITION                    0x00000002
#define _IPC2_INT1IP_MASK                        0x0000001C
#define _IPC2_INT1IP_LENGTH                      0x00000003

#define _IPC2_T2IS_POSITION                      0x00000008
#define _IPC2_T2IS_MASK                          0x00000300
#define _IPC2_T2IS_LENGTH                        0x00000002

#define _IPC2_T2IP_POSITION                      0x0000000A
#define _IPC2_T2IP_MASK                          0x00001C00
#define _IPC2_T2IP_LENGTH                        0x00000003

#define _IPC2_IC2EIS_POSITION                    0x00000010
#define _IPC2_IC2EIS_MASK                        0x00030000
#define _IPC2_IC2EIS_LENGTH                      0x00000002

#define _IPC2_IC2EIP_POSITION                    0x00000012
#define _IPC2_IC2EIP_MASK                        0x001C0000
#define _IPC2_IC2EIP_LENGTH                      0x00000003

