Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
#define _CFD1FIFOCON31_FSIZE_POSITION            0x00000018
#define _CFD1FIFOCON31_FSIZE_MASK                0x1F000000
#define _CFD1FIFOCON31_FSIZE_LENGTH              0x00000005

#define _CFD1FIFOCON31_PLSIZE_POSITION           0x0000001D
#define _CFD1FIFOCON31_PLSIZE_MASK               0xE0000000
#define _CFD1FIFOCON31_PLSIZE_LENGTH             0x00000003

#define _CFD1FIFOSTA31_TFNRFNIF_POSITION         0x00000000
#define _CFD1FIFOSTA31_TFNRFNIF_MASK             0x00000001
#define _CFD1FIFOSTA31_TFNRFNIF_LENGTH           0x00000001

#define _CFD1FIFOSTA31_TFHRFHIF_POSITION         0x00000001
#define _CFD1FIFOSTA31_TFHRFHIF_MASK             0x00000002
#define _CFD1FIFOSTA31_TFHRFHIF_LENGTH           0x00000001

#define _CFD1FIFOSTA31_TFERFFIF_POSITION         0x00000002
#define _CFD1FIFOSTA31_TFERFFIF_MASK             0x00000004
#define _CFD1FIFOSTA31_TFERFFIF_LENGTH           0x00000001

#define _CFD1FIFOSTA31_RXOVIF_POSITION           0x00000003
#define _CFD1FIFOSTA31_RXOVIF_MASK               0x00000008
#define _CFD1FIFOSTA31_RXOVIF_LENGTH             0x00000001

#define _CFD1FIFOSTA31_TXATIF_POSITION           0x00000004
#define _CFD1FIFOSTA31_TXATIF_MASK               0x00000010
#define _CFD1FIFOSTA31_TXATIF_LENGTH             0x00000001

#define _CFD1FIFOSTA31_TXERR_POSITION            0x00000005
#define _CFD1FIFOSTA31_TXERR_MASK                0x00000020
#define _CFD1FIFOSTA31_TXERR_LENGTH              0x00000001

#define _CFD1FIFOSTA31_TXLARB_POSITION           0x00000006
#define _CFD1FIFOSTA31_TXLARB_MASK               0x00000040
#define _CFD1FIFOSTA31_TXLARB_LENGTH             0x00000001

#define _CFD1FIFOSTA31_TXABT_POSITION            0x00000007
#define _CFD1FIFOSTA31_TXABT_MASK                0x00000080
#define _CFD1FIFOSTA31_TXABT_LENGTH              0x00000001

#define _CFD1FIFOSTA31_FIFOCI_POSITION           0x00000008
#define _CFD1FIFOSTA31_FIFOCI_MASK               0x00001F00
#define _CFD1FIFOSTA31_FIFOCI_LENGTH             0x00000005

#define _CFD1FIFOUA31_FIFOUA_POSITION            0x00000000
#define _CFD1FIFOUA31_FIFOUA_MASK                0xFFFFFFFF
#define _CFD1FIFOUA31_FIFOUA_LENGTH              0x00000020

#define _CFD1FLTCON0_F0BP_POSITION               0x00000000
#define _CFD1FLTCON0_F0BP_MASK                   0x0000001F
#define _CFD1FLTCON0_F0BP_LENGTH                 0x00000005

#define _CFD1FLTCON0_FLTEN0_POSITION             0x00000007
#define _CFD1FLTCON0_FLTEN0_MASK                 0x00000080
#define _CFD1FLTCON0_FLTEN0_LENGTH               0x00000001

#define _CFD1FLTCON0_F1BP_POSITION               0x00000008
#define _CFD1FLTCON0_F1BP_MASK                   0x00001F00
#define _CFD1FLTCON0_F1BP_LENGTH                 0x00000005

#define _CFD1FLTCON0_FLTEN1_POSITION             0x0000000F
#define _CFD1FLTCON0_FLTEN1_MASK                 0x00008000
#define _CFD1FLTCON0_FLTEN1_LENGTH               0x00000001

#define _CFD1FLTCON0_F2BP_POSITION               0x00000010
#define _CFD1FLTCON0_F2BP_MASK                   0x001F0000
#define _CFD1FLTCON0_F2BP_LENGTH                 0x00000005

#define _CFD1FLTCON0_FLTEN2_POSITION             0x00000017
#define _CFD1FLTCON0_FLTEN2_MASK                 0x00800000
#define _CFD1FLTCON0_FLTEN2_LENGTH               0x00000001

#define _CFD1FLTCON0_F3BP_POSITION               0x00000018
#define _CFD1FLTCON0_F3BP_MASK                   0x1F000000
#define _CFD1FLTCON0_F3BP_LENGTH                 0x00000005

#define _CFD1FLTCON0_FLTEN3_POSITION             0x0000001F
#define _CFD1FLTCON0_FLTEN3_MASK                 0x80000000
#define _CFD1FLTCON0_FLTEN3_LENGTH               0x00000001

#define _CFD1FLTCON1_F4BP_POSITION               0x00000000
#define _CFD1FLTCON1_F4BP_MASK                   0x0000001F
#define _CFD1FLTCON1_F4BP_LENGTH                 0x00000005

#define _CFD1FLTCON1_FLTEN4_POSITION             0x00000007
#define _CFD1FLTCON1_FLTEN4_MASK                 0x00000080
#define _CFD1FLTCON1_FLTEN4_LENGTH               0x00000001

#define _CFD1FLTCON1_F5BP_POSITION               0x00000008
#define _CFD1FLTCON1_F5BP_MASK                   0x00001F00
#define _CFD1FLTCON1_F5BP_LENGTH                 0x00000005

#define _CFD1FLTCON1_FLTEN5_POSITION             0x0000000F
#define _CFD1FLTCON1_FLTEN5_MASK                 0x00008000
#define _CFD1FLTCON1_FLTEN5_LENGTH               0x00000001

#define _CFD1FLTCON1_F6BP_POSITION               0x00000010
#define _CFD1FLTCON1_F6BP_MASK                   0x001F0000
#define _CFD1FLTCON1_F6BP_LENGTH                 0x00000005

#define _CFD1FLTCON1_FLTEN6_POSITION             0x00000017
#define _CFD1FLTCON1_FLTEN6_MASK                 0x00800000
#define _CFD1FLTCON1_FLTEN6_LENGTH               0x00000001

#define _CFD1FLTCON1_F7BP_POSITION               0x00000018
#define _CFD1FLTCON1_F7BP_MASK                   0x1F000000
#define _CFD1FLTCON1_F7BP_LENGTH                 0x00000005

#define _CFD1FLTCON1_FLTEN7_POSITION             0x0000001F
#define _CFD1FLTCON1_FLTEN7_MASK                 0x80000000
#define _CFD1FLTCON1_FLTEN7_LENGTH               0x00000001

#define _CFD1FLTCON2_F8BP_POSITION               0x00000000
#define _CFD1FLTCON2_F8BP_MASK                   0x0000001F
#define _CFD1FLTCON2_F8BP_LENGTH                 0x00000005

#define _CFD1FLTCON2_FLTEN8_POSITION             0x00000007
#define _CFD1FLTCON2_FLTEN8_MASK                 0x00000080
#define _CFD1FLTCON2_FLTEN8_LENGTH               0x00000001

#define _CFD1FLTCON2_F9BP_POSITION               0x00000008
#define _CFD1FLTCON2_F9BP_MASK                   0x00001F00
#define _CFD1FLTCON2_F9BP_LENGTH                 0x00000005

#define _CFD1FLTCON2_FLTEN9_POSITION             0x0000000F
#define _CFD1FLTCON2_FLTEN9_MASK                 0x00008000
#define _CFD1FLTCON2_FLTEN9_LENGTH               0x00000001

#define _CFD1FLTCON2_F10BP_POSITION              0x00000010
#define _CFD1FLTCON2_F10BP_MASK                  0x001F0000
#define _CFD1FLTCON2_F10BP_LENGTH                0x00000005

#define _CFD1FLTCON2_FLTEN10_POSITION            0x00000017
#define _CFD1FLTCON2_FLTEN10_MASK                0x00800000
#define _CFD1FLTCON2_FLTEN10_LENGTH              0x00000001

#define _CFD1FLTCON2_F11BP_POSITION              0x00000018
#define _CFD1FLTCON2_F11BP_MASK                  0x1F000000
#define _CFD1FLTCON2_F11BP_LENGTH                0x00000005

