Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
#define _CFD1MASK21_MSID_POSITION                0x00000000
#define _CFD1MASK21_MSID_MASK                    0x000007FF
#define _CFD1MASK21_MSID_LENGTH                  0x0000000B

#define _CFD1MASK21_MEID_POSITION                0x0000000B
#define _CFD1MASK21_MEID_MASK                    0x1FFFF800
#define _CFD1MASK21_MEID_LENGTH                  0x00000012

#define _CFD1MASK21_MSID11_POSITION              0x0000001D
#define _CFD1MASK21_MSID11_MASK                  0x20000000
#define _CFD1MASK21_MSID11_LENGTH                0x00000001

#define _CFD1MASK21_MIDE_POSITION                0x0000001E
#define _CFD1MASK21_MIDE_MASK                    0x40000000
#define _CFD1MASK21_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ22_SID_POSITION               0x00000000
#define _CFD1FLTOBJ22_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ22_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ22_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ22_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ22_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ22_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ22_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ22_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ22_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ22_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ22_EXIDE_LENGTH               0x00000001

#define _CFD1MASK22_MSID_POSITION                0x00000000
#define _CFD1MASK22_MSID_MASK                    0x000007FF
#define _CFD1MASK22_MSID_LENGTH                  0x0000000B

#define _CFD1MASK22_MEID_POSITION                0x0000000B
#define _CFD1MASK22_MEID_MASK                    0x1FFFF800
#define _CFD1MASK22_MEID_LENGTH                  0x00000012

#define _CFD1MASK22_MSID11_POSITION              0x0000001D
#define _CFD1MASK22_MSID11_MASK                  0x20000000
#define _CFD1MASK22_MSID11_LENGTH                0x00000001

#define _CFD1MASK22_MIDE_POSITION                0x0000001E
#define _CFD1MASK22_MIDE_MASK                    0x40000000
#define _CFD1MASK22_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ23_SID_POSITION               0x00000000
#define _CFD1FLTOBJ23_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ23_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ23_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ23_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ23_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ23_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ23_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ23_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ23_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ23_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ23_EXIDE_LENGTH               0x00000001

#define _CFD1MASK23_MSID_POSITION                0x00000000
#define _CFD1MASK23_MSID_MASK                    0x000007FF
#define _CFD1MASK23_MSID_LENGTH                  0x0000000B

#define _CFD1MASK23_MEID_POSITION                0x0000000B
#define _CFD1MASK23_MEID_MASK                    0x1FFFF800
#define _CFD1MASK23_MEID_LENGTH                  0x00000012

#define _CFD1MASK23_MSID11_POSITION              0x0000001D
#define _CFD1MASK23_MSID11_MASK                  0x20000000
#define _CFD1MASK23_MSID11_LENGTH                0x00000001

#define _CFD1MASK23_MIDE_POSITION                0x0000001E
#define _CFD1MASK23_MIDE_MASK                    0x40000000
#define _CFD1MASK23_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ24_SID_POSITION               0x00000000
#define _CFD1FLTOBJ24_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ24_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ24_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ24_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ24_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ24_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ24_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ24_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ24_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ24_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ24_EXIDE_LENGTH               0x00000001

#define _CFD1MASK24_MSID_POSITION                0x00000000
#define _CFD1MASK24_MSID_MASK                    0x000007FF
#define _CFD1MASK24_MSID_LENGTH                  0x0000000B

#define _CFD1MASK24_MEID_POSITION                0x0000000B
#define _CFD1MASK24_MEID_MASK                    0x1FFFF800
#define _CFD1MASK24_MEID_LENGTH                  0x00000012

#define _CFD1MASK24_MSID11_POSITION              0x0000001D
#define _CFD1MASK24_MSID11_MASK                  0x20000000
#define _CFD1MASK24_MSID11_LENGTH                0x00000001

#define _CFD1MASK24_MIDE_POSITION                0x0000001E
#define _CFD1MASK24_MIDE_MASK                    0x40000000
#define _CFD1MASK24_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ25_SID_POSITION               0x00000000
#define _CFD1FLTOBJ25_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ25_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ25_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ25_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ25_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ25_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ25_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ25_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ25_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ25_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ25_EXIDE_LENGTH               0x00000001

#define _CFD1MASK25_MSID_POSITION                0x00000000
#define _CFD1MASK25_MSID_MASK                    0x000007FF
#define _CFD1MASK25_MSID_LENGTH                  0x0000000B

#define _CFD1MASK25_MEID_POSITION                0x0000000B
#define _CFD1MASK25_MEID_MASK                    0x1FFFF800
#define _CFD1MASK25_MEID_LENGTH                  0x00000012

#define _CFD1MASK25_MSID11_POSITION              0x0000001D
#define _CFD1MASK25_MSID11_MASK                  0x20000000
#define _CFD1MASK25_MSID11_LENGTH                0x00000001

#define _CFD1MASK25_MIDE_POSITION                0x0000001E
#define _CFD1MASK25_MIDE_MASK                    0x40000000
#define _CFD1MASK25_MIDE_LENGTH                  0x00000001

