Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
#define _ADCDSTAT_RAFIEN5_POSITION               0x0000000D
#define _ADCDSTAT_RAFIEN5_MASK                   0x00002000
#define _ADCDSTAT_RAFIEN5_LENGTH                 0x00000001

#define _ADCDSTAT_DMACEN_POSITION                0x0000000F
#define _ADCDSTAT_DMACEN_MASK                    0x00008000
#define _ADCDSTAT_DMACEN_LENGTH                  0x00000001

#define _ADCDSTAT_RBF0_POSITION                  0x00000010
#define _ADCDSTAT_RBF0_MASK                      0x00010000
#define _ADCDSTAT_RBF0_LENGTH                    0x00000001

#define _ADCDSTAT_RBF1_POSITION                  0x00000011
#define _ADCDSTAT_RBF1_MASK                      0x00020000
#define _ADCDSTAT_RBF1_LENGTH                    0x00000001

#define _ADCDSTAT_RBF2_POSITION                  0x00000012
#define _ADCDSTAT_RBF2_MASK                      0x00040000
#define _ADCDSTAT_RBF2_LENGTH                    0x00000001

#define _ADCDSTAT_RBF3_POSITION                  0x00000013
#define _ADCDSTAT_RBF3_MASK                      0x00080000
#define _ADCDSTAT_RBF3_LENGTH                    0x00000001

#define _ADCDSTAT_RBF4_POSITION                  0x00000014
#define _ADCDSTAT_RBF4_MASK                      0x00100000
#define _ADCDSTAT_RBF4_LENGTH                    0x00000001

#define _ADCDSTAT_RBF5_POSITION                  0x00000015
#define _ADCDSTAT_RBF5_MASK                      0x00200000
#define _ADCDSTAT_RBF5_LENGTH                    0x00000001

#define _ADCDSTAT_WOVERR_POSITION                0x00000017
#define _ADCDSTAT_WOVERR_MASK                    0x00800000
#define _ADCDSTAT_WOVERR_LENGTH                  0x00000001

#define _ADCDSTAT_RBFIEN0_POSITION               0x00000018
#define _ADCDSTAT_RBFIEN0_MASK                   0x01000000
#define _ADCDSTAT_RBFIEN0_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN1_POSITION               0x00000019
#define _ADCDSTAT_RBFIEN1_MASK                   0x02000000
#define _ADCDSTAT_RBFIEN1_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN2_POSITION               0x0000001A
#define _ADCDSTAT_RBFIEN2_MASK                   0x04000000
#define _ADCDSTAT_RBFIEN2_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN3_POSITION               0x0000001B
#define _ADCDSTAT_RBFIEN3_MASK                   0x08000000
#define _ADCDSTAT_RBFIEN3_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN4_POSITION               0x0000001C
#define _ADCDSTAT_RBFIEN4_MASK                   0x10000000
#define _ADCDSTAT_RBFIEN4_LENGTH                 0x00000001

#define _ADCDSTAT_RBFIEN5_POSITION               0x0000001D
#define _ADCDSTAT_RBFIEN5_MASK                   0x20000000
#define _ADCDSTAT_RBFIEN5_LENGTH                 0x00000001

#define _ADCDSTAT_DMAEN_POSITION                 0x0000001F
#define _ADCDSTAT_DMAEN_MASK                     0x80000000
#define _ADCDSTAT_DMAEN_LENGTH                   0x00000001

#define _ADCCNTB_ADCCNTB_POSITION                0x00000000
#define _ADCCNTB_ADCCNTB_MASK                    0xFFFFFFFF
#define _ADCCNTB_ADCCNTB_LENGTH                  0x00000020

#define _ADCDMAB_ADCDMAB_POSITION                0x00000000
#define _ADCDMAB_ADCDMAB_MASK                    0xFFFFFFFF
#define _ADCDMAB_ADCDMAB_LENGTH                  0x00000020

#define _ADCTRGSNS_LVL0_POSITION                 0x00000000
#define _ADCTRGSNS_LVL0_MASK                     0x00000001
#define _ADCTRGSNS_LVL0_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL1_POSITION                 0x00000001
#define _ADCTRGSNS_LVL1_MASK                     0x00000002
#define _ADCTRGSNS_LVL1_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL2_POSITION                 0x00000002
#define _ADCTRGSNS_LVL2_MASK                     0x00000004
#define _ADCTRGSNS_LVL2_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL3_POSITION                 0x00000003
#define _ADCTRGSNS_LVL3_MASK                     0x00000008
#define _ADCTRGSNS_LVL3_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL4_POSITION                 0x00000004
#define _ADCTRGSNS_LVL4_MASK                     0x00000010
#define _ADCTRGSNS_LVL4_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL5_POSITION                 0x00000005
#define _ADCTRGSNS_LVL5_MASK                     0x00000020
#define _ADCTRGSNS_LVL5_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL6_POSITION                 0x00000006
#define _ADCTRGSNS_LVL6_MASK                     0x00000040
#define _ADCTRGSNS_LVL6_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL7_POSITION                 0x00000007
#define _ADCTRGSNS_LVL7_MASK                     0x00000080
#define _ADCTRGSNS_LVL7_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL8_POSITION                 0x00000008
#define _ADCTRGSNS_LVL8_MASK                     0x00000100
#define _ADCTRGSNS_LVL8_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL9_POSITION                 0x00000009
#define _ADCTRGSNS_LVL9_MASK                     0x00000200
#define _ADCTRGSNS_LVL9_LENGTH                   0x00000001

#define _ADCTRGSNS_LVL10_POSITION                0x0000000A
#define _ADCTRGSNS_LVL10_MASK                    0x00000400
#define _ADCTRGSNS_LVL10_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL11_POSITION                0x0000000B
#define _ADCTRGSNS_LVL11_MASK                    0x00000800
#define _ADCTRGSNS_LVL11_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL12_POSITION                0x0000000C
#define _ADCTRGSNS_LVL12_MASK                    0x00001000
#define _ADCTRGSNS_LVL12_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL13_POSITION                0x0000000D
#define _ADCTRGSNS_LVL13_MASK                    0x00002000
#define _ADCTRGSNS_LVL13_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL14_POSITION                0x0000000E
#define _ADCTRGSNS_LVL14_MASK                    0x00004000
#define _ADCTRGSNS_LVL14_LENGTH                  0x00000001

#define _ADCTRGSNS_LVL15_POSITION                0x0000000F
#define _ADCTRGSNS_LVL15_MASK                    0x00008000
#define _ADCTRGSNS_LVL15_LENGTH                  0x00000001

