Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph064.h
#define _ADCEIEN1_EIEN26_POSITION                0x0000001A
#define _ADCEIEN1_EIEN26_MASK                    0x04000000
#define _ADCEIEN1_EIEN26_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN27_POSITION                0x0000001B
#define _ADCEIEN1_EIEN27_MASK                    0x08000000
#define _ADCEIEN1_EIEN27_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN33_POSITION                0x00000001
#define _ADCEIEN2_EIEN33_MASK                    0x00000002
#define _ADCEIEN2_EIEN33_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN34_POSITION                0x00000002
#define _ADCEIEN2_EIEN34_MASK                    0x00000004
#define _ADCEIEN2_EIEN34_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN35_POSITION                0x00000003
#define _ADCEIEN2_EIEN35_MASK                    0x00000008
#define _ADCEIEN2_EIEN35_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN36_POSITION                0x00000004
#define _ADCEIEN2_EIEN36_MASK                    0x00000010
#define _ADCEIEN2_EIEN36_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN37_POSITION                0x00000005
#define _ADCEIEN2_EIEN37_MASK                    0x00000020
#define _ADCEIEN2_EIEN37_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN38_POSITION                0x00000006
#define _ADCEIEN2_EIEN38_MASK                    0x00000040
#define _ADCEIEN2_EIEN38_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN39_POSITION                0x00000007
#define _ADCEIEN2_EIEN39_MASK                    0x00000080
#define _ADCEIEN2_EIEN39_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN40_POSITION                0x00000008
#define _ADCEIEN2_EIEN40_MASK                    0x00000100
#define _ADCEIEN2_EIEN40_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN41_POSITION                0x00000009
#define _ADCEIEN2_EIEN41_MASK                    0x00000200
#define _ADCEIEN2_EIEN41_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN45_POSITION                0x0000000D
#define _ADCEIEN2_EIEN45_MASK                    0x00002000
#define _ADCEIEN2_EIEN45_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN46_POSITION                0x0000000E
#define _ADCEIEN2_EIEN46_MASK                    0x00004000
#define _ADCEIEN2_EIEN46_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN47_POSITION                0x0000000F
#define _ADCEIEN2_EIEN47_MASK                    0x00008000
#define _ADCEIEN2_EIEN47_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN48_POSITION                0x00000010
#define _ADCEIEN2_EIEN48_MASK                    0x00010000
#define _ADCEIEN2_EIEN48_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN49_POSITION                0x00000011
#define _ADCEIEN2_EIEN49_MASK                    0x00020000
#define _ADCEIEN2_EIEN49_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN50_POSITION                0x00000012
#define _ADCEIEN2_EIEN50_MASK                    0x00040000
#define _ADCEIEN2_EIEN50_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN51_POSITION                0x00000013
#define _ADCEIEN2_EIEN51_MASK                    0x00080000
#define _ADCEIEN2_EIEN51_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN52_POSITION                0x00000014
#define _ADCEIEN2_EIEN52_MASK                    0x00100000
#define _ADCEIEN2_EIEN52_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN53_POSITION                0x00000015
#define _ADCEIEN2_EIEN53_MASK                    0x00200000
#define _ADCEIEN2_EIEN53_LENGTH                  0x00000001

#define _ADCEISTAT1_EIRDY0_POSITION              0x00000000
#define _ADCEISTAT1_EIRDY0_MASK                  0x00000001
#define _ADCEISTAT1_EIRDY0_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY1_POSITION              0x00000001
#define _ADCEISTAT1_EIRDY1_MASK                  0x00000002
#define _ADCEISTAT1_EIRDY1_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY2_POSITION              0x00000002
#define _ADCEISTAT1_EIRDY2_MASK                  0x00000004
#define _ADCEISTAT1_EIRDY2_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY3_POSITION              0x00000003
#define _ADCEISTAT1_EIRDY3_MASK                  0x00000008
#define _ADCEISTAT1_EIRDY3_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY4_POSITION              0x00000004
#define _ADCEISTAT1_EIRDY4_MASK                  0x00000010
#define _ADCEISTAT1_EIRDY4_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY5_POSITION              0x00000005
#define _ADCEISTAT1_EIRDY5_MASK                  0x00000020
#define _ADCEISTAT1_EIRDY5_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY6_POSITION              0x00000006
#define _ADCEISTAT1_EIRDY6_MASK                  0x00000040
#define _ADCEISTAT1_EIRDY6_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY7_POSITION              0x00000007
#define _ADCEISTAT1_EIRDY7_MASK                  0x00000080
#define _ADCEISTAT1_EIRDY7_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY8_POSITION              0x00000008
#define _ADCEISTAT1_EIRDY8_MASK                  0x00000100
#define _ADCEISTAT1_EIRDY8_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY9_POSITION              0x00000009
#define _ADCEISTAT1_EIRDY9_MASK                  0x00000200
#define _ADCEISTAT1_EIRDY9_LENGTH                0x00000001

#define _ADCEISTAT1_EIRDY10_POSITION             0x0000000A
#define _ADCEISTAT1_EIRDY10_MASK                 0x00000400
#define _ADCEISTAT1_EIRDY10_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY11_POSITION             0x0000000B
#define _ADCEISTAT1_EIRDY11_MASK                 0x00000800
#define _ADCEISTAT1_EIRDY11_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY12_POSITION             0x0000000C
#define _ADCEISTAT1_EIRDY12_MASK                 0x00001000
#define _ADCEISTAT1_EIRDY12_LENGTH               0x00000001

#define _ADCEISTAT1_EIRDY13_POSITION             0x0000000D
#define _ADCEISTAT1_EIRDY13_MASK                 0x00002000
#define _ADCEISTAT1_EIRDY13_LENGTH               0x00000001

